<!--
 * @Author: Harry
 * @Date: 2022-03-28 13:29:05
 * @LastEditors: harry
 * @Github: https://github.com/rr210
 * @LastEditTime: 2022-04-13 10:50:20
 * @FilePath: \vant-u\src\components\About.vue
-->
<template>
  <div class="about-wrap">
    <div class="svg-about">
      <svg t="1649818071445" class="icon-about" viewBox="0 0 1555 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
        p-id="9914">
        <path d="M806.4 772.266667m-192 0a192 192 0 1 0 384 0 192 192 0 1 0-384 0Z" fill="#1DB676" p-id="9915"></path>
        <path
          d="M1452.8 32c19.2 0 36.266667 14.933333 36.266667 34.133333 0 4.266667 0 8.533333-2.133334 12.8-132.266667 362.666667-326.4 497.066667-672 573.866667h-2.133333c-40.533333 87.466667-68.266667 181.333333-78.933333 277.333333-4.266667 40.533333-64 42.666667-70.4 2.133334-8.533333-49.066667-27.733333-89.6-59.733334-119.466667l12.8-6.4c-164.266667 91.733333-260.266667 98.133333-388.266666 51.2l-29.866667-10.666667-19.2-6.4c-40.533333-12.8-68.266667-14.933333-100.266667-8.533333-34.133333 8.533333-57.6-32-34.133333-57.6C290.133333 494.933333 507.733333 448 674.133333 648.533333c12.8 14.933333 10.666667 38.4-6.4 49.066667-14.933333 12.8-36.266667 10.666667-49.066666-4.266667-119.466667-142.933333-264.533333-128-454.4 57.6l-10.666667 8.533334 6.4 2.133333c10.666667 2.133333 21.333333 4.266667 32 8.533333l10.666667 4.266667 12.8 4.266667 27.733333 10.666666c100.266667 36.266667 170.666667 38.4 288-17.066666-53.333333-17.066667-125.866667-23.466667-217.6-12.8-19.2 2.133333-36.266667-12.8-38.4-32-2.133333-19.2 12.8-36.266667 32-38.4 194.133333-21.333333 315.733333 23.466667 379.733333 108.8l2.133334 4.266666 4.266666-12.8c55.466667-204.8 177.066667-386.133333 362.666667-544l14.933333-12.8c14.933333-12.8 38.4-10.666667 49.066667 4.266667 12.8 14.933333 10.666667 38.4-4.266667 49.066667-106.666667 87.466667-192 183.466667-253.866666 285.866666 266.666667-68.266667 424.533333-183.466667 537.6-454.4l4.266666-8.533333h-10.666666l-32 2.133333c-439.466667 29.866667-629.333333 170.666667-595.2 422.4l2.133333 8.533334c2.133333 19.2-10.666667 38.4-29.866667 40.533333-19.2 2.133333-38.4-10.666667-40.533333-29.866667-53.333333-328.533333 206.933333-501.333333 755.2-520.533333z"
          fill="#293231" p-id="9916"></path>
      </svg>
    </div>
    <div>本系统支持<em>3</em>大类别：草本害虫，木本害虫，根部害虫</div>
    <div><em>{{ cateList.length }}</em>种常见的中草药害虫的识别，其中包括：<span v-for="(item, index) in cateList" :key="item">{{
      item
    }}{{ index == cateList.length - 1 ? '。' : '、' }}</span>
    </div>  </div>
</template>

<script>
import { CATE_URL } from '@/utils/api/urlapi'
import { getCate } from '@/utils/service/mine'
import { reactive, toRefs } from 'vue'
// import { ref } from '@vue/reactivity'
export default {
  name: 'About',
  setup() {
    const state = reactive({
      cateList: []
    })
    const getcate = async function () {
      const { data: res } = await getCate(CATE_URL)
      console.log(res)
      state.cateList = res.data.map(v => v['zh-name'])
    }
    getcate()
    return {
      getcate,
      ...toRefs(state)
    }
  }
}
</script>

<style lang="less" scoped>
.svg-about {
  display: flex;
  justify-content: center;
  align-items: center;

  .icon-about {
    width: 80px;
    height: 80px;
  }
}

.about-wrap {
  font-size: 16px;
  border: 10px double #ccc;
  padding: 10px;
  width: 80vw;
}

em {
  font-weight: 550;
  font-size: 20px;
  color: red;
}
</style>
